{
  "architectures": [
    "MizanEncoderHF"
  ],
  "attention_probs_dropout_prob": 0.1,
  "backbone_name": "sentence-transformers/all-MiniLM-L6-v2",
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mizan-encoder",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "pooling": "balanced-mean",
  "position_embedding_type": "absolute",
  "proj_dim": 384,
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
